Documents/НачислениеОклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>НачислениеОклада</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиПоЗаработнойПлате</xr:Item>
				<xr:Item>CalculationRegister.ЗаработнаяПлата</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CalculationRegisters/ЗаработнаяПлата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<CalculationRegister>
		<Properties>
			<Name>ЗаработнаяПлата</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РасчетныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

AccumulationRegisters/ДолгиПоЗаработнойПлате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ДолгиПоЗаработнойПлате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/НачислениеОклада/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаработнаяПлата
	Движения.ЗаработнаяПлата.Записывать = Истина;
	
	// регистр ДолгиПоЗаработнойПлате Приход
	Движения.ДолгиПоЗаработнойПлате.Записывать = Истина;
	
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.ЗаработнаяПлата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад;
		Движение.ПериодДействияНачало = ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ДатаОкончания);
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		//Движение.Сумма = 1;
		Движение.РасчетныеДанные = ТекСтрокаНачисления.Начислено;
		Движение.ГрафикРаботы = ГрафикРаботы; 
		
		
		Движения.ЗаработнаяПлата.Записать();
		
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаработнаяПлатаДанныеГрафика.ЗначениеПериодДействия КАК Норма,
		|	ЗаработнаяПлатаДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ЗаработнаяПлатаДанныеГрафика.РасчетныеДанные КАК РасчетныеДанные
		|ИЗ
		|	РегистрРасчета.ЗаработнаяПлата.ДанныеГрафика(Регистратор = &Регистратор) КАК ЗаработнаяПлатаДанныеГрафика
		|ГДЕ
		|	ЗаработнаяПлатаДанныеГрафика.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Сотрудник", ТекСтрокаНачисления.Сотрудник);
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий(); 
			
			Если ВыборкаДетальныеЗаписи.Норма <> 0 Тогда
				
				Оклад = ВыборкаДетальныеЗаписи.РасчетныеДанные * 
				ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.Норма;
				
				Движение.Сумма = Оклад;
				
				Движения.ЗаработнаяПлата.Записать();
				
				
				// регистр ДолгиПоЗаработнойПлате Приход
				Движение = Движения.ДолгиПоЗаработнойПлате.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник; 
				Движение.ВидНачисления = ПланыВидовРасчета.Начисления.Оклад;
				Движение.Сумма = Оклад;
				
			Иначе
				Сообщить("Не заполнен график работ!");			
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
